app/views/comments/_comment.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", nil]]
---
<p class="username">
    Review By <%= link_to User.find(comment.user_id).username, user_path(comment.user_id) %>