app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "pizza_place_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "asdfasdf"], ["pizza_place_id", 5], ["user_id", 6], ["created_at", "2015-11-06 20:14:44.306389"], ["updated_at", "2015-11-06 20:14:44.306389"]]
---
    def create
      @comment = Comment.new(comment_params)
      @comment.pizza_place_id = params[:pizza_place_id]
      @comment.user_id = current_user.id

      if @comment.save

SELECT  "pizza_places".* FROM "pizza_places" WHERE "pizza_places"."id" = $1 LIMIT 1  [["id", 6]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 20]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]
---
    def edit
      @pizza_place = PizzaPlace.find(params[:pizza_place_id])
      @comment = Comment.find(params[:id])
      if current_user.id != @comment.user_id
        redirect_to pizza_place_path(@pizza_place)
      else
          @comment = Comment.find(params[:id])

SELECT  "pizza_places".* FROM "pizza_places" WHERE "pizza_places"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 22]]
UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "hello123"], ["updated_at", "2015-11-06 16:05:41.040438"], ["id", 22]]
---
    def update
      @pizza_place = PizzaPlace.find(params[:pizza_place_id])
      @comment = Comment.find(params[:id])
      @comment.update(comment_params)

SELECT  "pizza_places".* FROM "pizza_places" WHERE "pizza_places"."id" = $1 LIMIT 1  [["id", 6]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 17]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 17]]
---
    def destroy
      @pizza_place = PizzaPlace.find(params[:pizza_place_id])
      @comment = Comment.find(params[:id])
      @comment.destroy