app/controllers/favorite_pizza_places_controller.rb

INSERT INTO "favorites" ("favorited_id", "favorited_type", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["favorited_id", 5], ["favorited_type", "PizzaPlace"], ["user_id", 5], ["created_at", "2015-11-07 15:30:50.291689"], ["updated_at", "2015-11-07 15:30:50.291689"]]
---
  def create

    @favorite = Favorite.create(favorited: @pizza_place, user: current_user)

DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 4]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."favorited_id" = $1 AND "favorites"."user_id" = $2  ORDER BY "favorites"."id" ASC LIMIT 1  [["favorited_id", 5], ["user_id", 6]]
---
  def destroy
    @favorite = Favorite.where(favorited_id: @pizza_place.id, user_id: current_user.id).first.destroy

SELECT  "pizza_places".* FROM "pizza_places" WHERE "pizza_places"."id" = $1 LIMIT 1  [["id", nil]]
---
  def set_pizza_place
    @pizza_place = PizzaPlace.find(params[:pizza_place_id] || params[:id])