app/controllers/pizza_places_controller.rb

SELECT "pizza_places".* FROM "pizza_places"
---
  def index
    @pizza_places = PizzaPlace.all

SELECT  "pizza_places".* FROM "pizza_places" WHERE "pizza_places"."id" = $1 LIMIT 1  [["id", 5]]
---
  def show
    @pizza_place = PizzaPlace.find(params[:id])